# Chapter 5 #

In [1]:
import numpy as np
import pandas as pd
import requests
import json

pd.set_option('display.notebook_repr_html', True) #nice tables in iPython
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)

In [2]:
pd.DataFrame(np.array([[10, 11], [20, 21]]))

    0   1
0  10  11
1  20  21

In [3]:
df1 = pd.DataFrame([pd.Series(np.arange(10,15)),
                    pd.Series(np.arange(15, 20))])
df1

    0   1   2   3   4
0  10  11  12  13  14
1  15  16  17  18  19

In [4]:
df1.shape

(2, 5)

In [5]:
df = pd.DataFrame(np.array([[10, 11], [20, 21]]),
                  columns=['a', 'b'])
df

    a   b
0  10  11
1  20  21

In [6]:
df.columns

Index(['a', 'b'], dtype='object')

In [7]:
"{0}, {1}".format(df.columns[0], df.columns[1])

'a, b'

In [8]:
df.columns = ['c1', 'c2']
df

   c1  c2
0  10  11
1  20  21

In [9]:
df = pd.DataFrame(np.array([[0,1], [2,3]]),
                          columns=['c1', 'c2'],
                          index=['r1','r2'])
df

    c1  c2
r1   0   1
r2   2   3

In [10]:
df.index

Index(['r1', 'r2'], dtype='object')

In [11]:
s1 = pd.Series(np.arange(1,6,1))
s2 = pd.Series(np.arange(6,11,1))
pd.DataFrame({'c1': s1, 'c2':s2})

   c1  c2
0   1   6
1   2   7
2   3   8
3   4   9
4   5  10

In [12]:
s3 = pd.Series(np.arange(12, 14), index=[1, 2])
df = pd.DataFrame({'c1': s1, 'c2':s2, 'c3': s3})
df

   c1  c2  c3
0   1   6 NaN
1   2   7  12
2   3   8  13
3   4   9 NaN
4   5  10 NaN

## Example Data

In [13]:
!head -n 3 sp500.csv

Date,Open,High,Low,Close,Volume,Adj Close
2016-02-23,1942.380005,1942.380005,1919.439941,1921.27002,3890650000,1921.27002
2016-02-22,1924.439941,1946.699951,1924.439941,1945.50,4054710000,1945.50

In [14]:
# from: https://finance.yahoo.com/q/hp?s=%5EGSPC+Historical+Prices

sp500 = pd.read_csv('sp500.csv', 
#                     index_col = 'Symbol',
#                     usecols=[0,2,3,7]
                   )

In [15]:
sp500.head()

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-02-23,1942.380005,1942.380005,1919.439941,1921.270020,3890650000,1921.270020
1,2016-02-22,1924.439941,1946.699951,1924.439941,1945.500000,4054710000,1945.500000
2,2016-02-19,1916.739990,1918.780029,1902.170044,1917.780029,4142850000,1917.780029
3,2016-02-18,1927.569946,1930.000000,1915.089966,1917.829956,4436490000,1917.829956
4,2016-02-17,1898.800049,1930.680054,1898.800049,1926.819946,5011540000,1926.819946

http://data.okfn.org/data/core/s-and-p-500-companies#data
http://data.okfn.org/data/core/s-and-p-500-companies/r/constituents-financials.csv

In [16]:
sp500 = pd.read_csv('sp500_constituents-financials.csv', 
                    index_col = 'Symbol',
                    usecols=[0,2,3,7]
                   )

In [17]:
sp500.head()

                        Sector     Price  Book Value
Symbol
MMM                Industrials  137.9200      20.960
ABT                Health Care   42.2199      15.437
ABBV               Health Care   57.6700       3.330
ACN     Information Technology   96.2400       9.470
ACE                 Financials  100.8900      91.270

In [18]:
sp500.tail()

                        Sector   Price  Book Value
Symbol
XYL                Industrials  32.305      11.460
YHOO    Information Technology  30.445      35.679
YUM     Consumer Discretionary  79.600       3.630
ZBH                Health Care  97.460      49.800
ZTS                Health Care  44.250       2.360

In [19]:
len(sp500)

494

In [20]:
sp500.index

Index(['MMM', 'ABT', 'ABBV', 'ACN', 'ACE', 'ADBE', 'ADT', 'AES', 'AET', 'AMG',
       ...
       'WYNN', 'XEL', 'XRX', 'XLNX', 'XL', 'XYL', 'YHOO', 'YUM', 'ZBH', 'ZTS'],
      dtype='object', name='Symbol', length=494)

In [21]:
sp500.columns

Index(['Sector', 'Price', 'Book Value'], dtype='object')

http://finance.yahoo.com/q/hp?s=AAPL
http://real-chart.finance.yahoo.com/table.csv?s=AAPL&d=1&e=24&f=2016&g=d&a=11&b=12&c=1980&ignore=.csv
http://real-chart.finance.yahoo.com/table.csv?s=MSFT&d=1&e=24&f=2016&g=d&a=11&b=12&c=1980&ignore=.csv

In [22]:
aapl = pd.read_csv("aapl.csv" , 
                   index_col = ['Date'], 
                   usecols=['Date', 'Close'])
aapl.columns = ['AAPL']
aapl.head()

                 AAPL
Date
2016-02-23  94.690002
2016-02-22  96.879997
2016-02-19  96.040001
2016-02-18  96.260002
2016-02-17  98.120003

In [23]:
msft = pd.read_csv("msft.csv" , 
                   index_col = ['Date'],
                   usecols=['Date', 'Close'])
msft.columns = ['MSFT']
msft.head()

                 MSFT
Date
2016-02-23  51.180000
2016-02-22  52.650002
2016-02-19  51.820000
2016-02-18  52.189999
2016-02-17  52.419998

In [24]:
sp500[[1,2]].head() # by zero-based location

           Price  Book Value
Symbol
MMM     137.9200      20.960
ABT      42.2199      15.437
ABBV     57.6700       3.330
ACN      96.2400       9.470
ACE     100.8900      91.270

In [25]:
sp500[[1]].head()

           Price
Symbol
MMM     137.9200
ABT      42.2199
ABBV     57.6700
ACN      96.2400
ACE     100.8900

In [26]:
type(sp500[[1]].head())

pandas.core.frame.DataFrame

In [27]:
df=sp500.copy()
df.columns=[0,1,2]
df.head()

                             0         1       2
Symbol
MMM                Industrials  137.9200  20.960
ABT                Health Care   42.2199  15.437
ABBV               Health Care   57.6700   3.330
ACN     Information Technology   96.2400   9.470
ACE                 Financials  100.8900  91.270

In [28]:
df[1]

Symbol
MMM     137.9200
ABT      42.2199
ABBV     57.6700
ACN      96.2400
ACE     100.8900
          ...
XYL      32.3050
YHOO     30.4450
YUM      79.6000
ZBH      97.4600
ZTS      44.2500
Name: 1, dtype: float64

In [29]:
sp500['Price']

Symbol
MMM     137.9200
ABT      42.2199
ABBV     57.6700
ACN      96.2400
ACE     100.8900
          ...
XYL      32.3050
YHOO     30.4450
YUM      79.6000
ZBH      97.4600
ZTS      44.2500
Name: Price, dtype: float64

In [30]:
sp500[['Price','Sector']]

           Price                  Sector
Symbol
MMM     137.9200             Industrials
ABT      42.2199             Health Care
ABBV     57.6700             Health Care
ACN      96.2400  Information Technology
ACE     100.8900              Financials
...          ...                     ...
XYL      32.3050             Industrials
YHOO     30.4450  Information Technology
YUM      79.6000  Consumer Discretionary
ZBH      97.4600             Health Care
ZTS      44.2500             Health Care

[494 rows x 2 columns]

In [31]:
sp500.Price

Symbol
MMM     137.9200
ABT      42.2199
ABBV     57.6700
ACN      96.2400
ACE     100.8900
          ...
XYL      32.3050
YHOO     30.4450
YUM      79.6000
ZBH      97.4600
ZTS      44.2500
Name: Price, dtype: float64

In [32]:
type(sp500.Price)

pandas.core.series.Series

In [33]:
loc = sp500.columns.get_loc('Price')
loc

1

### Slicing (not as efficient)

In [34]:
sp500[:5]

                        Sector     Price  Book Value
Symbol
MMM                Industrials  137.9200      20.960
ABT                Health Care   42.2199      15.437
ABBV               Health Care   57.6700       3.330
ACN     Information Technology   96.2400       9.470
ACE                 Financials  100.8900      91.270

In [35]:
sp500['ABT':'ACN']

                        Sector    Price  Book Value
Symbol
ABT                Health Care  42.2199      15.437
ABBV               Health Care  57.6700       3.330
ACN     Information Technology  96.2400       9.470

### by .loc[] and .iloc[]

In [36]:
sp500.loc['MMM']

Sector        Industrials
Price              137.92
Book Value          20.96
Name: MMM, dtype: object

In [37]:
type(sp500.loc['MMM'])

pandas.core.series.Series

In [38]:
sp500.loc[['MMM']]

             Sector   Price  Book Value
Symbol
MMM     Industrials  137.92       20.96

In [39]:
type(sp500.loc[['MMM']])

pandas.core.frame.DataFrame

In [40]:
sp500.loc[['MMM', 'MSFT']]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  137.92       20.96
MSFT    Information Technology   43.41        9.98

In [41]:
sp500.iloc[[0, 2]]

             Sector   Price  Book Value
Symbol
MMM     Industrials  137.92       20.96
ABBV    Health Care   57.67        3.33

In [42]:
i1 = sp500.index.get_loc('MMM')
i2 = sp500.index.get_loc('A')
i3 = sp500.index.get_loc('MSFT')
"{0} {1} {2}".format(i1, i2, i3)

'0 11 301'

In [43]:
sp500.iloc[[i1, i2, i3]]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  137.92       20.96
A                  Health Care   35.08       12.36
MSFT    Information Technology   43.41        9.98

### ix: combines .loc and .iloc
#### .loc and .iloc recommended for clarity and performance

In [44]:
sp500.ix[['MSFT', 'ZTS']]

                        Sector  Price  Book Value
Symbol
MSFT    Information Technology  43.41        9.98
ZTS                Health Care  44.25        2.36

In [45]:
sp500.ix[[10, 200, 450]]

                        Sector     Price  Book Value
Symbol
AFL                 Financials   56.9150      39.520
GE                 Industrials   24.7101      10.846
UA      Consumer Discretionary  101.3900       6.560

### Scalar lookup

In [46]:
sp500.at['MMM', 'Price']

137.91999999999999

In [47]:
sp500.iat[0,1]

137.91999999999999

# Selection by Boolean

In [48]:
sp500.Price < 100

Symbol
MMM     False
ABT      True
ABBV     True
ACN      True
ACE     False
        ...
XYL      True
YHOO     True
YUM      True
ZBH      True
ZTS      True
Name: Price, dtype: bool

In [49]:
sp500[sp500.Price < 100]

                        Sector    Price  Book Value
Symbol
ABT                Health Care  42.2199      15.437
ABBV               Health Care  57.6700       3.330
ACN     Information Technology  96.2400       9.470
ADBE    Information Technology  82.6800      13.720
ADT                Industrials  30.9000      17.950
...                        ...      ...         ...
XYL                Industrials  32.3050      11.460
YHOO    Information Technology  30.4450      35.679
YUM     Consumer Discretionary  79.6000       3.630
ZBH                Health Care  97.4600      49.800
ZTS                Health Care  44.2500       2.360

[398 rows x 3 columns]

In [50]:
r = sp500[(sp500.Price < 10) & 
          (sp500.Price > 0)]['Price']
r

Symbol
AA      9.450
CHK     8.230
FCX     9.925
FTR     4.860
GNW     4.758
HCBK    9.280
RF      8.950
Name: Price, dtype: float64

There is an error the book

## Modifying structure/content

Renaming Columns

In [51]:
df = sp500.rename(columns = 
                    {'Book Value': 'BookValue'})
df[:2]

             Sector     Price  BookValue
Symbol
MMM     Industrials  137.9200     20.960
ABT     Health Care   42.2199     15.437

In [52]:
sp500.columns

Index(['Sector', 'Price', 'Book Value'], dtype='object')

In [53]:
sp500.rename(columns = 
            {'Book Value': 'BookValue'},
            inplace = True)
sp500.columns

Index(['Sector', 'Price', 'BookValue'], dtype='object')

In [54]:
sp500.BookValue[:5]

Symbol
MMM     20.960
ABT     15.437
ABBV     3.330
ACN      9.470
ACE     91.270
Name: BookValue, dtype: float64

Inserting Columns

In [55]:
copy = sp500.copy()
copy['TwicePrice'] = sp500.Price * 2
copy[:2]

             Sector     Price  BookValue  TwicePrice
Symbol
MMM     Industrials  137.9200     20.960    275.8400
ABT     Health Care   42.2199     15.437     84.4398

In [56]:
copy = sp500.copy()
copy.insert(1, 'TwicePrice', sp500.Price * 2)
copy[:2]

             Sector  TwicePrice     Price  BookValue
Symbol
MMM     Industrials    275.8400  137.9200     20.960
ABT     Health Care     84.4398   42.2199     15.437

In [57]:
rcopy = sp500[0:3][['Price']].copy()
rcopy

           Price
Symbol
MMM     137.9200
ABT      42.2199
ABBV     57.6700

In [58]:
s = pd.Series(
            {'MMM': 'Is in the DataFrame',
             'MSFT': 'Not in the DataFrame'} )
s

MMM      Is in the DataFrame
MSFT    Not in the DataFrame
dtype: object

In [59]:
rcopy['Comment'] = s
rcopy

           Price              Comment
Symbol
MMM     137.9200  Is in the DataFrame
ABT      42.2199                  NaN
ABBV     57.6700                  NaN

Replacing content in columns

In [60]:
copy = sp500.copy()
copy.Price = sp500.Price * 2
copy[:5]

                        Sector     Price  BookValue
Symbol
MMM                Industrials  275.8400     20.960
ABT                Health Care   84.4398     15.437
ABBV               Health Care  115.3400      3.330
ACN     Information Technology  192.4800      9.470
ACE                 Financials  201.7800     91.270

In [61]:
copy = sp500.copy()
prices = sp500.iloc[[3, 1, 0]].Price.copy()
prices

Symbol
ACN     96.2400
ABT     42.2199
MMM    137.9200
Name: Price, dtype: float64

In [62]:
copy.Price = prices
copy

                        Sector     Price  BookValue
Symbol
MMM                Industrials  137.9200     20.960
ABT                Health Care   42.2199     15.437
ABBV               Health Care       NaN      3.330
ACN     Information Technology   96.2400      9.470
ACE                 Financials       NaN     91.270
...                        ...       ...        ...
XYL                Industrials       NaN     11.460
YHOO    Information Technology       NaN     35.679
YUM     Consumer Discretionary       NaN      3.630
ZBH                Health Care       NaN     49.800
ZTS                Health Care       NaN      2.360

[494 rows x 3 columns]

Deleting columns

In [63]:
copy = sp500[:2].copy()
copy

             Sector     Price  BookValue
Symbol
MMM     Industrials  137.9200     20.960
ABT     Health Care   42.2199     15.437

In [64]:
del copy['BookValue']
copy

             Sector     Price
Symbol
MMM     Industrials  137.9200
ABT     Health Care   42.2199

In [65]:
copy = sp500[:2].copy()
popped = copy.pop('Sector')
copy

           Price  BookValue
Symbol
MMM     137.9200     20.960
ABT      42.2199     15.437

In [66]:
popped

Symbol
MMM    Industrials
ABT    Health Care
Name: Sector, dtype: object

use .drop to remove a column

In [67]:
copy = sp500[:2].copy()
afterdrop = copy.drop(['Sector'], axis = 1)
afterdrop

           Price  BookValue
Symbol
MMM     137.9200     20.960
ABT      42.2199     15.437

use .drop to remove a row

In [68]:
copy = sp500[:2].copy()
afterdrop = copy.drop(['ABT'], axis = 0)
afterdrop

             Sector   Price  BookValue
Symbol
MMM     Industrials  137.92      20.96

Adding rows

In [70]:
df1 = sp500.iloc[0:3].copy()
df2 = sp500.iloc[[10, 11, 2]]
appended= df1.append(df2)
appended

             Sector     Price  BookValue
Symbol
MMM     Industrials  137.9200     20.960
ABT     Health Care   42.2199     15.437
ABBV    Health Care   57.6700      3.330
AFL      Financials   56.9150     39.520
A       Health Care   35.0800     12.360
ABBV    Health Care   57.6700      3.330

In [74]:
df3 = pd.DataFrame(0.0, index=df1.index, columns=['PER'])
df3

        PER
Symbol
MMM       0
ABT       0
ABBV      0

In [75]:
df1.append(df3)

        BookValue  PER     Price       Sector
Symbol
MMM        20.960  NaN  137.9200  Industrials
ABT        15.437  NaN   42.2199  Health Care
ABBV        3.330  NaN   57.6700  Health Care
MMM           NaN    0       NaN          NaN
ABT           NaN    0       NaN          NaN
ABBV          NaN    0       NaN          NaN

In [77]:
df1.append(df3, ignore_index=True)

   BookValue  PER     Price       Sector
0     20.960  NaN  137.9200  Industrials
1     15.437  NaN   42.2199  Health Care
2      3.330  NaN   57.6700  Health Care
3        NaN    0       NaN          NaN
4        NaN    0       NaN          NaN
5        NaN    0       NaN          NaN

In [78]:
df1 = sp500.iloc[0:3].copy()
df2 = sp500.iloc[[10, 11, 2]]
pd.concat([df1, df2])

             Sector     Price  BookValue
Symbol
MMM     Industrials  137.9200     20.960
ABT     Health Care   42.2199     15.437
ABBV    Health Care   57.6700      3.330
AFL      Financials   56.9150     39.520
A       Health Care   35.0800     12.360
ABBV    Health Care   57.6700      3.330

In [81]:
df2_2 = df2.copy()
df2_2.insert(3, 'Foo', pd.Series(0, index=df2.index)) # add a column
df2_2

             Sector   Price  BookValue  Foo
Symbol
AFL      Financials  56.915      39.52    0
A       Health Care  35.080      12.36    0
ABBV    Health Care  57.670       3.33    0

In [82]:
pd.concat([df1, df2_2])

        BookValue  Foo     Price       Sector
Symbol
MMM        20.960  NaN  137.9200  Industrials
ABT        15.437  NaN   42.2199  Health Care
ABBV        3.330  NaN   57.6700  Health Care
AFL        39.520    0   56.9150   Financials
A          12.360    0   35.0800  Health Care
ABBV        3.330    0   57.6700  Health Care

In [83]:
r = pd.concat([df1, df2_2], keys=['df1', 'df2'])
r

            BookValue  Foo     Price       Sector
    Symbol
df1 MMM        20.960  NaN  137.9200  Industrials
    ABT        15.437  NaN   42.2199  Health Care
    ABBV        3.330  NaN   57.6700  Health Care
df2 AFL        39.520    0   56.9150   Financials
    A          12.360    0   35.0800  Health Care
    ABBV        3.330    0   57.6700  Health Care

In [84]:
df3 = sp500[:3][[0,1]]
df3

             Sector     Price
Symbol
MMM     Industrials  137.9200
ABT     Health Care   42.2199
ABBV    Health Care   57.6700

In [86]:
df4 = sp500[:3][[2]]
df4

        BookValue
Symbol
MMM        20.960
ABT        15.437
ABBV        3.330

In [87]:
pd.concat([df3, df4], axis=1)

             Sector     Price  BookValue
Symbol
MMM     Industrials  137.9200     20.960
ABT     Health Care   42.2199     15.437
ABBV    Health Care   57.6700      3.330

In [93]:
df4_2 = df4.copy()
df4_2.insert(1, 'Sector', pd.Series(1, index=df4_2.index))
df4_2

        BookValue  Sector
Symbol
MMM        20.960       1
ABT        15.437       1
ABBV        3.330       1

In [94]:
pd.concat([df3, df4_2], axis=1)

             Sector     Price  BookValue  Sector
Symbol
MMM     Industrials  137.9200     20.960       1
ABT     Health Care   42.2199     15.437       1
ABBV    Health Care   57.6700      3.330       1

In [95]:
df5 = sp500[:3][[0, 1]]
df5

             Sector     Price
Symbol
MMM     Industrials  137.9200
ABT     Health Care   42.2199
ABBV    Health Care   57.6700

In [96]:
df6 = sp500[2:5][[0,1]]
df6

                        Sector   Price
Symbol
ABBV               Health Care   57.67
ACN     Information Technology   96.24
ACE                 Financials  100.89

In [97]:
pd.concat([df5, df6], join='inner', axis =1)

             Sector  Price       Sector  Price
Symbol
ABBV    Health Care  57.67  Health Care  57.67

In [101]:
ss = sp500[:3].copy()
ss.loc['FOO'] = ['the sector', 100, 110]
ss

# .loc will change the value in place

             Sector     Price  BookValue
Symbol
MMM     Industrials  137.9200     20.960
ABT     Health Care   42.2199     15.437
ABBV    Health Care   57.6700      3.330
FOO      the sector  100.0000    110.000

In [102]:
ss = sp500[:3].copy()
ss.loc[:, 'PER'] = 0
ss

             Sector     Price  BookValue  PER
Symbol
MMM     Industrials  137.9200     20.960    0
ABT     Health Care   42.2199     15.437    0
ABBV    Health Care   57.6700      3.330    0

In [109]:
ss = sp500[:5].copy()
ss

                        Sector     Price  BookValue
Symbol
MMM                Industrials  137.9200     20.960
ABT                Health Care   42.2199     15.437
ABBV               Health Care   57.6700      3.330
ACN     Information Technology   96.2400      9.470
ACE                 Financials  100.8900     91.270

In [108]:
afterdrop = ss.drop(['ABT', 'ACN'])
afterdrop

             Sector   Price  BookValue
Symbol
MMM     Industrials  137.92      20.96
ABBV    Health Care   57.67       3.33
ACE      Financials  100.89      91.27

In [105]:
ss

                        Sector     Price  BookValue
Symbol
MMM                Industrials  137.9200     20.960
ABT                Health Care   42.2199     15.437
ABBV               Health Care   57.6700      3.330
ACN     Information Technology   96.2400      9.470
ACE                 Financials  100.8900     91.270

In [112]:
selection = sp500.Price > 300
"{0} {1}".format(len(selection), selection.sum())

'494 8'

In [113]:
withPriceLessThank300 = sp500[~selection]
withPriceLessThank300

                        Sector     Price  BookValue
Symbol
MMM                Industrials  137.9200     20.960
ABT                Health Care   42.2199     15.437
ABBV               Health Care   57.6700      3.330
ACN     Information Technology   96.2400      9.470
ACE                 Financials  100.8900     91.270
...                        ...       ...        ...
XYL                Industrials   32.3050     11.460
YHOO    Information Technology   30.4450     35.679
YUM     Consumer Discretionary   79.6000      3.630
ZBH                Health Care   97.4600     49.800
ZTS                Health Care   44.2500      2.360

[486 rows x 3 columns]

In [115]:
onlyFirstThree = sp500[:3]
onlyFirstThree
# this is only a view.  Changes here will change sp500

             Sector     Price  BookValue
Symbol
MMM     Industrials  137.9200     20.960
ABT     Health Care   42.2199     15.437
ABBV    Health Care   57.6700      3.330

In [116]:
subset = sp500[:3].copy()
subset

             Sector     Price  BookValue
Symbol
MMM     Industrials  137.9200     20.960
ABT     Health Care   42.2199     15.437
ABBV    Health Care   57.6700      3.330

In [118]:
# Don't use because of performance issues
subset.ix['MMM', 'Price'] = 0
subset

             Sector    Price  BookValue
Symbol
MMM     Industrials   0.0000     20.960
ABT     Health Care  42.2199     15.437
ABBV    Health Care  57.6700      3.330

In [119]:
# Better Performance
subset = sp500[:3].copy()
subset.loc['MMM', 'Price'] = 10
subset.loc['ABBV', 'Price'] = 20
subset

             Sector    Price  BookValue
Symbol
MMM     Industrials  10.0000     20.960
ABT     Health Care  42.2199     15.437
ABBV    Health Care  20.0000      3.330

In [121]:
# Best Performance, no need to map labels to locations
subset = sp500[:3].copy()
price_loc = sp500.columns.get_loc('Price')
abt_row_loc = sp500.index.get_loc('ABT')
subset.iloc[abt_row_loc, price_loc] = 1000
subset

             Sector    Price  BookValue
Symbol
MMM     Industrials   137.92     20.960
ABT     Health Care  1000.00     15.437
ABBV    Health Care    57.67      3.330

# Arithmetic on a DataFrame

In [123]:
np.random.seed(123456)
df = pd.DataFrame(np.random.randn(5, 4),
                  columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  0.469112 -0.282863 -1.509059 -1.135632
1  1.212112 -0.173215  0.119209 -1.044236
2 -0.861849 -2.104569 -0.494929  1.071804
3  0.721555 -0.706771 -1.039575  0.271860
4 -0.424972  0.567020  0.276232 -1.087401

In [124]:
df * 2

          A         B         C         D
0  0.938225 -0.565727 -3.018117 -2.271265
1  2.424224 -0.346429  0.238417 -2.088472
2 -1.723698 -4.209138 -0.989859  2.143608
3  1.443110 -1.413542 -2.079150  0.543720
4 -0.849945  1.134041  0.552464 -2.174801

In [126]:
s = df.iloc[0]
diff = df - s
diff

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1  0.743000  0.109649  1.628267  0.091396
2 -1.330961 -1.821706  1.014129  2.207436
3  0.252443 -0.423908  0.469484  1.407492
4 -0.894085  0.849884  1.785291  0.048232

In [127]:
diff2 = s - df
diff2

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1 -0.743000 -0.109649 -1.628267 -0.091396
2  1.330961  1.821706 -1.014129 -2.207436
3 -0.252443  0.423908 -0.469484 -1.407492
4  0.894085 -0.849884 -1.785291 -0.048232

In [128]:
s2 = s[1:3]
s2['E'] = 0
df + s2

    A         B         C   D   E
0 NaN -0.565727 -3.018117 NaN NaN
1 NaN -0.456078 -1.389850 NaN NaN
2 NaN -2.387433 -2.003988 NaN NaN
3 NaN -0.989634 -2.548633 NaN NaN
4 NaN  0.284157 -1.232826 NaN NaN

In [129]:
s2 # original first row B, C

B   -0.282863
C   -1.509059
E    0.000000
Name: 0, dtype: float64

In [131]:
subframe = df[1:4][['B', 'C']]
subframe

          B         C
1 -0.173215  0.119209
2 -2.104569 -0.494929
3 -0.706771 -1.039575

In [132]:
df - subframe

    A   B   C   D
0 NaN NaN NaN NaN
1 NaN   0   0 NaN
2 NaN   0   0 NaN
3 NaN   0   0 NaN
4 NaN NaN NaN NaN

In [135]:
a_col = df['A']
df.sub(a_col, axis=0) #subtract

   A         B         C         D
0  0 -0.751976 -1.978171 -1.604745
1  0 -1.385327 -1.092903 -2.256348
2  0 -1.242720  0.366920  1.933653
3  0 -1.428326 -1.761130 -0.449695
4  0  0.991993  0.701204 -0.662428

In [136]:
a_col

0    0.469112
1    1.212112
2   -0.861849
3    0.721555
4   -0.424972
Name: A, dtype: float64

## Resetting and reindexing

In [137]:
reset_sp500 = sp500.reset_index()
reset_sp500

    Symbol                  Sector     Price  BookValue
0      MMM             Industrials  137.9200     20.960
1      ABT             Health Care   42.2199     15.437
2     ABBV             Health Care   57.6700      3.330
3      ACN  Information Technology   96.2400      9.470
4      ACE              Financials  100.8900     91.270
..     ...                     ...       ...        ...
489    XYL             Industrials   32.3050     11.460
490   YHOO  Information Technology   30.4450     35.679
491    YUM  Consumer Discretionary   79.6000      3.630
492    ZBH             Health Care   97.4600     49.800
493    ZTS             Health Care   44.2500      2.360

[494 rows x 4 columns]

In [140]:
reset_sp500.set_index('Symbol')

                        Sector     Price  BookValue
Symbol
MMM                Industrials  137.9200     20.960
ABT                Health Care   42.2199     15.437
ABBV               Health Care   57.6700      3.330
ACN     Information Technology   96.2400      9.470
ACE                 Financials  100.8900     91.270
...                        ...       ...        ...
XYL                Industrials   32.3050     11.460
YHOO    Information Technology   30.4450     35.679
YUM     Consumer Discretionary   79.6000      3.630
ZBH                Health Care   97.4600     49.800
ZTS                Health Care   44.2500      2.360

[494 rows x 3 columns]

In [142]:
subset = sp500[:4].copy()
subset

                        Sector     Price  BookValue
Symbol
MMM                Industrials  137.9200     20.960
ABT                Health Care   42.2199     15.437
ABBV               Health Care   57.6700      3.330
ACN     Information Technology   96.2400      9.470

In [143]:
reindexed = subset.reindex(index=['MMM', 'ABBV', 'FOO'])
reindexed

             Sector   Price  BookValue
Symbol
MMM     Industrials  137.92      20.96
ABBV    Health Care   57.67       3.33
FOO             NaN     NaN        NaN

In [145]:
subset.reindex(columns=['Price', 'BookValue', 'NewCol'])

           Price  BookValue  NewCol
Symbol
MMM     137.9200     20.960     NaN
ABT      42.2199     15.437     NaN
ABBV     57.6700      3.330     NaN
ACN      96.2400      9.470     NaN

## Hierarchical indexing

In [147]:
reindexed = sp500.reset_index()
multi_fi = reindexed.set_index(['Sector', 'Symbol'])
multi_fi

                                  Price  BookValue
Sector                 Symbol
Industrials            MMM     137.9200     20.960
Health Care            ABT      42.2199     15.437
                       ABBV     57.6700      3.330
Information Technology ACN      96.2400      9.470
Financials             ACE     100.8900     91.270
...                                 ...        ...
Industrials            XYL      32.3050     11.460
Information Technology YHOO     30.4450     35.679
Consumer Discretionary YUM      79.6000      3.630
Health Care            ZBH      97.4600     49.800
                       ZTS      44.2500      2.360

[494 rows x 2 columns]

In [148]:
type(multi_fi.index)

pandas.core.index.MultiIndex

In [153]:
print (multi_fi.index) # different than in book

MultiIndex(levels=[['Consumer Discretionary', 'Consumer Staples', 'Energy', 'Financials', 'Health Care', 'Industrials', 'Information Technology', 'Materials', 'Telecommunication Services', 'Utilities'], ['A', 'AA', 'AAL', 'AAPL', 'ABBV', 'ABC', 'ABT', 'ACE', 'ACN', 'ADBE', 'ADI', 'ADM', 'ADP', 'ADS', 'ADSK', 'ADT', 'AEE', 'AEP', 'AES', 'AET', 'AFL', 'AGN', 'AIG', 'AIV', 'AIZ', 'AKAM', 'ALL', 'ALLE', 'ALTR', 'ALXN', 'AMAT', 'AME', 'AMG', 'AMGN', 'AMP', 'AMT', 'AMZN', 'AN', 'ANTM', 'AON', 'APA', 'APC', 'APD', 'APH', 'ARG', 'ATI', 'AVB', 'AVGO', 'AVY', 'AXP', 'AZO', 'BA', 'BAC', 'BAX', 'BBBY', 'BBT', 'BBY', 'BCR', 'BDX', 'BEN', 'BF-B', 'BHI', 'BIIB', 'BK', 'BLK', 'BLL', 'BMY', 'BRCM', 'BRK-B', 'BSX', 'BWA', 'BXP', 'C', 'CA', 'CAG', 'CAH', 'CAM', 'CAT', 'CB', 'CBG', 'CBS', 'CCE', 'CCI', 'CCL', 'CELG', 'CERN', 'CF', 'CHK', 'CHRW', 'CI', 'CINF', 'CL', 'CLX', 'CMA', 'CMCSA', 'CME', 'CMG', 'CMI', 'CMS', 'CNP', 'CNX', 'COF', 'COG', 'COH', 'COL', 'COP', 'COST', 'CPB', 'CSC', 'CSCO', 'CSX', 'CTAS', 'CTL', 'CTSH', 'CTXS', 'CVC', 'CVS', 'CVX', 'D', 'DAL', 'DD', 'DE', 'DFS', 'DG', 'DGX', 'DHI', 'DHR', 'DIS', 'DISCA', 'DLPH', 'DLTR', 'DNB', 'DO', 'DOV', 'DOW', 'DPS', 'DRI', 'DTE', 'DTV', 'DUK', 'DVA', 'DVN', 'EA', 'EBAY', 'ECL', 'ED', 'EFX', 'EIX', 'EL', 'EMC', 'EMN', 'EMR', 'ENDP', 'EOG', 'EQIX', 'EQR', 'EQT', 'ES', 'ESRX', 'ESS', 'ESV', 'ETFC', 'ETN', 'ETR', 'EW', 'EXC', 'EXPD', 'EXPE', 'F', 'FAST', 'FB', 'FCX', 'FDO', 'FDX', 'FE', 'FFIV', 'FIS', 'FISV', 'FITB', 'FLIR', 'FLR', 'FLS', 'FMC', 'FOSL', 'FOXA', 'FSLR', 'FTI', 'FTR', 'GAS', 'GD', 'GE', 'GGP', 'GILD', 'GIS', 'GLW', 'GM', 'GMCR', 'GME', 'GNW', 'GOOGL', 'GPC', 'GPS', 'GRMN', 'GS', 'GT', 'GWW', 'HAL', 'HAR', 'HAS', 'HBAN', 'HBI', 'HCA', 'HCBK', 'HCN', 'HCP', 'HD', 'HES', 'HIG', 'HOG', 'HON', 'HOT', 'HP', 'HPQ', 'HRB', 'HRL', 'HRS', 'HSIC', 'HSP', 'HST', 'HSY', 'HUM', 'IBM', 'ICE', 'IFF', 'INTC', 'INTU', 'IP', 'IPG', 'IR', 'IRM', 'ISRG', 'ITW', 'IVZ', 'JCI', 'JEC', 'JNJ', 'JNPR', 'JOY', 'JPM', 'JWN', 'K', 'KEY', 'KIM', 'KLAC', 'KMB', 'KMI', 'KMX', 'KO', 'KORS', 'KR', 'KRFT', 'KSS', 'KSU', 'L', 'LB', 'LEG', 'LEN', 'LH', 'LLL', 'LLTC', 'LLY', 'LM', 'LMT', 'LNC', 'LOW', 'LRCX', 'LUK', 'LUV', 'LVLT', 'LYB', 'M', 'MA', 'MAC', 'MAR', 'MAS', 'MAT', 'MCD', 'MCHP', 'MCK', 'MCO', 'MDLZ', 'MDT', 'MET', 'MHFI', 'MHK', 'MJN', 'MKC', 'MLM', 'MMC', 'MMM', 'MNK', 'MNST', 'MO', 'MON', 'MOS', 'MPC', 'MRK', 'MRO', 'MS', 'MSFT', 'MSI', 'MTB', 'MU', 'MUR', 'MYL', 'NAVI', 'NBL', 'NDAQ', 'NE', 'NEE', 'NEM', 'NFLX', 'NFX', 'NI', 'NKE', 'NOC', 'NOV', 'NRG', 'NSC', 'NTAP', 'NTRS', 'NUE', 'NVDA', 'NWL', 'NWSA', 'O', 'OI', 'OKE', 'OMC', 'ORCL', 'ORLY', 'OXY', 'PAYX', 'PBCT', 'PBI', 'PCAR', 'PCG', 'PCL', 'PCLN', 'PCP', 'PDCO', 'PEG', 'PEP', 'PFE', 'PFG', 'PG', 'PGR', 'PH', 'PHM', 'PKI', 'PLD', 'PM', 'PNC', 'PNR', 'PNW', 'POM', 'PPG', 'PPL', 'PRGO', 'PRU', 'PSA', 'PSX', 'PVH', 'PWR', 'PX', 'PXD', 'QCOM', 'QEP', 'QRVO', 'R', 'RAI', 'RCL', 'REGN', 'RF', 'RHI', 'RHT', 'RIG', 'RL', 'ROK', 'ROP', 'ROST', 'RRC', 'RSG', 'RTN', 'SBUX', 'SCG', 'SCHW', 'SE', 'SEE', 'SHW', 'SIAL', 'SJM', 'SLB', 'SLG', 'SNA', 'SNDK', 'SNI', 'SO', 'SPG', 'SPLS', 'SRCL', 'SRE', 'STI', 'STJ', 'STT', 'STX', 'STZ', 'SWK', 'SWKS', 'SWN', 'SYK', 'SYMC', 'SYY', 'T', 'TAP', 'TDC', 'TE', 'TEL', 'TGNA', 'TGT', 'THC', 'TIF', 'TJX', 'TMK', 'TMO', 'TRIP', 'TROW', 'TRV', 'TSCO', 'TSN', 'TSO', 'TSS', 'TWC', 'TWX', 'TXN', 'TXT', 'TYC', 'UA', 'UHS', 'UNH', 'UNM', 'UNP', 'UPS', 'URBN', 'URI', 'USB', 'UTX', 'V', 'VAR', 'VFC', 'VIAB', 'VLO', 'VMC', 'VNO', 'VRSN', 'VRTX', 'VTR', 'VZ', 'WAT', 'WBA', 'WDC', 'WEC', 'WFC', 'WFM', 'WHR', 'WM', 'WMB', 'WMT', 'WU', 'WY', 'WYN', 'WYNN', 'XEC', 'XEL', 'XL', 'XLNX', 'XOM', 'XRAY', 'XRX', 'XYL', 'YHOO', 'YUM', 'ZBH', 'ZTS']],
           labels=[[5, 4, 4, 6, 3, 6, 5, 9, 4, 3, 3, 4, 9, 7, 7, 6, 7, 4, 7, 5, 4, 6, 3, 6, 1, 0, 9, 5, 9, 3, 3, 3, 3, 4, 5, 4, 6, 2, 6, 4, 3, 2, 3, 6, 6, 1, 3, 8, 6, 6, 0, 0, 6, 3, 7, 2, 7, 3, 3, 4, 4, 3, 4, 0, 3, 0, 4, 3, 5, 0, 3, 4, 4, 6, 1, 5, 6, 0, 2, 2, 1, 3, 4, 0, 0, 5, 3, 0, 4, 9, 8, 4, 7, 2, 2, 0, 3, 4, 2, 3, 5, 6, 3, 6, 1, 3, 9, 0, 1, 1, 6, 1, 0, 3, 6, 1, 2, 2, 9, 1, 6, 1, 3, 5, 5, 1, 0, 5, 0, 4, 5, 0, 5, 4, 2, 2, 0, 3, 0, 0, 0, 9, 5, 7, 1, 9, 7, 9, 5, 3, 7, 5, 6, 7, 9, 4, 6, 6, 5, 4, 2, 9, 2, 2, 5, 3, 3, 3, 1, 9, 9, 0, 5, 4, 2, 6, 6, 0, 5, 5, 6, 3, 6, 9, 6, 6, 5, 5, 7, 2, 0, 0, 3, 7, 8, 0, 0, 0, 0, 5, 5, 3, 1, 0, 3, 4, 3, 0, 6, 5, 0, 2, 0, 0, 0, 6, 3, 0, 4, 3, 3, 2, 1, 2, 6, 0, 5, 1, 4, 3, 3, 4, 3, 5, 5, 6, 3, 6, 7, 7, 0, 6, 4, 3, 3, 5, 4, 0, 5, 3, 6, 5, 1, 1, 3, 1, 3, 2, 6, 0, 1, 1, 0, 5, 4, 6, 3, 0, 0, 3, 8, 4, 3, 6, 5, 3, 0, 7, 3, 3, 0, 4, 2, 2, 0, 3, 7, 5, 6, 0, 1, 0, 3, 4, 1, 4, 4, 3, 0, 6, 6, 6, 0, 1, 1, 7, 1, 3, 3, 7, 6, 2, 4, 3, 2, 3, 6, 0, 0, 2, 7, 0, 9, 0, 9, 2, 2, 0, 5, 3, 5, 9, 7, 6, 0, 2, 0, 2, 6, 7, 5, 5, 4, 6, 5, 3, 9, 1, 4, 4, 4, 9, 1, 2, 9, 2, 5, 3, 3, 7, 9, 7, 5, 0, 3, 1, 3, 3, 3, 3, 9, 0, 0, 2, 6, 6, 5, 4, 0, 2, 5, 3, 6, 4, 3, 5, 1, 5, 5, 5, 5, 0, 0, 5, 6, 9, 4, 2, 3, 0, 6, 7, 9, 7, 7, 3, 6, 3, 1, 5, 9, 5, 2, 2, 4, 5, 0, 0, 0, 3, 5, 4, 3, 6, 1, 3, 0, 6, 9, 0, 4, 6, 2, 6, 5, 4, 0, 0, 0, 0, 3, 6, 0, 2, 3, 0, 0, 5, 1, 3, 0, 5, 5, 5, 5, 4, 4, 3, 0, 2, 4, 3, 6, 8, 4, 0, 0, 6, 3, 7, 1, 1, 0, 5, 4, 9, 3, 6, 6, 3, 0, 1, 2, 0, 0, 9, 6, 6, 3, 5, 6, 0, 4, 4], [299, 6, 4, 8, 7, 9, 15, 18, 19, 32, 20, 0, 188, 42, 44, 25, 1, 29, 45, 27, 21, 13, 26, 28, 302, 36, 16, 2, 17, 49, 22, 35, 34, 5, 31, 33, 43, 41, 10, 38, 39, 40, 23, 3, 30, 11, 24, 423, 14, 12, 37, 50, 47, 46, 48, 61, 65, 52, 63, 57, 53, 55, 58, 54, 68, 56, 62, 64, 51, 70, 71, 69, 66, 67, 60, 88, 73, 115, 102, 76, 107, 101, 75, 256, 83, 77, 79, 80, 84, 99, 112, 85, 86, 87, 117, 96, 78, 89, 482, 90, 111, 109, 72, 114, 92, 95, 98, 103, 257, 81, 113, 91, 94, 93, 108, 74, 105, 100, 145, 416, 194, 106, 82, 110, 97, 116, 125, 126, 136, 140, 121, 129, 119, 487, 141, 132, 138, 122, 128, 123, 130, 118, 133, 134, 135, 137, 120, 139, 131, 161, 150, 162, 143, 144, 147, 164, 142, 149, 151, 152, 160, 163, 153, 156, 146, 154, 155, 159, 148, 157, 165, 167, 166, 158, 486, 175, 170, 172, 169, 173, 176, 178, 185, 174, 177, 179, 181, 180, 182, 186, 168, 183, 59, 171, 187, 197, 201, 202, 195, 189, 190, 191, 193, 200, 198, 192, 203, 204, 199, 205, 223, 206, 210, 218, 207, 225, 217, 208, 211, 214, 213, 221, 229, 216, 222, 215, 219, 224, 227, 228, 212, 230, 209, 241, 238, 234, 232, 231, 233, 236, 237, 235, 240, 242, 239, 244, 245, 243, 247, 248, 246, 262, 250, 196, 251, 254, 252, 255, 253, 261, 260, 259, 264, 268, 267, 275, 271, 265, 266, 276, 278, 270, 273, 269, 272, 263, 274, 279, 311, 282, 280, 300, 307, 305, 283, 298, 297, 284, 281, 285, 296, 286, 293, 288, 295, 291, 306, 292, 258, 287, 312, 309, 294, 424, 290, 303, 301, 289, 308, 304, 310, 313, 314, 317, 326, 315, 329, 321, 333, 322, 320, 334, 319, 324, 323, 318, 316, 249, 328, 330, 325, 327, 331, 332, 340, 341, 338, 337, 339, 336, 345, 357, 350, 342, 363, 343, 365, 352, 359, 368, 353, 346, 361, 371, 364, 375, 344, 347, 362, 366, 367, 374, 349, 348, 354, 355, 356, 360, 369, 370, 351, 358, 372, 377, 378, 376, 373, 124, 387, 391, 393, 335, 385, 382, 383, 392, 380, 384, 388, 104, 389, 390, 381, 379, 405, 395, 226, 402, 396, 406, 415, 398, 411, 399, 400, 408, 418, 403, 401, 404, 407, 277, 419, 397, 413, 417, 409, 394, 220, 414, 410, 420, 412, 421, 422, 436, 429, 427, 426, 428, 430, 425, 440, 444, 445, 434, 431, 443, 442, 432, 433, 441, 438, 386, 437, 435, 184, 446, 439, 455, 447, 451, 452, 454, 456, 449, 448, 450, 453, 461, 458, 466, 464, 467, 465, 459, 460, 457, 463, 462, 477, 469, 127, 475, 468, 471, 472, 470, 478, 479, 474, 473, 476, 480, 481, 483, 488, 485, 484, 489, 490, 491, 492, 493]],
           names=['Sector', 'Symbol'])

In [154]:
len(multi_fi.index.levels)

2

In [155]:
multi_fi.index.levels[0]

Index(['Consumer Discretionary', 'Consumer Staples', 'Energy', 'Financials',
       'Health Care', 'Industrials', 'Information Technology', 'Materials',
       'Telecommunication Services', 'Utilities'],
      dtype='object', name='Sector')

In [156]:
multi_fi.index.levels[1]

Index(['A', 'AA', 'AAL', 'AAPL', 'ABBV', 'ABC', 'ABT', 'ACE', 'ACN', 'ADBE',
       ...
       'XL', 'XLNX', 'XOM', 'XRAY', 'XRX', 'XYL', 'YHOO', 'YUM', 'ZBH', 'ZTS'],
      dtype='object', name='Symbol', length=494)

In [158]:
multi_fi.index.get_level_values(0)

Index(['Industrials', 'Health Care', 'Health Care', 'Information Technology',
       'Financials', 'Information Technology', 'Industrials', 'Utilities',
       'Health Care', 'Financials',
       ...
       'Consumer Discretionary', 'Utilities', 'Information Technology',
       'Information Technology', 'Financials', 'Industrials',
       'Information Technology', 'Consumer Discretionary', 'Health Care',
       'Health Care'],
      dtype='object', name='Sector', length=494)

In [159]:
multi_fi.xs('Industrials')

           Price  BookValue
Symbol
MMM     137.9200     20.960
ADT      30.9000     17.950
ALLE     60.5500      0.000
AAL      42.1600      5.360
AME      51.1300     14.260
...          ...        ...
UPS      98.5005      2.174
URI      66.4500     15.220
UTX      89.1100     34.110
WM       49.5400     11.920
XYL      32.3050     11.460

[63 rows x 2 columns]

In [161]:
multi_fi.xs('ALLE', level=1)

             Price  BookValue
Sector
Industrials  60.55          0

In [162]:
multi_fi.xs('Industrials')

           Price  BookValue
Symbol
MMM     137.9200     20.960
ADT      30.9000     17.950
ALLE     60.5500      0.000
AAL      42.1600      5.360
AME      51.1300     14.260
...          ...        ...
UPS      98.5005      2.174
URI      66.4500     15.220
UTX      89.1100     34.110
WM       49.5400     11.920
XYL      32.3050     11.460

[63 rows x 2 columns]

In [163]:
multi_fi.xs('Industrials', drop_level = False)

                       Price  BookValue
Sector      Symbol
Industrials MMM     137.9200     20.960
            ADT      30.9000     17.950
            ALLE     60.5500      0.000
            AAL      42.1600      5.360
            AME      51.1300     14.260
...                      ...        ...
            UPS      98.5005      2.174
            URI      66.4500     15.220
            UTX      89.1100     34.110
            WM       49.5400     11.920
            XYL      32.3050     11.460

[63 rows x 2 columns]

In [164]:
multi_fi.xs('Industrials').xs('UPS')

Price        98.5005
BookValue     2.1740
Name: UPS, dtype: float64

In [167]:
multi_fi.xs(('Industrials', 'UPS'))

Price        98.5005
BookValue     2.1740
Name: (Industrials, UPS), dtype: float64

## Summarized data and descriptive statistics

In [192]:
stocks = pd.concat([aapl, msft], axis=1)
# aapl.copy()
# stocks = stocks.append(msft)
stocks = stocks[stocks.AAPL.notnull() & stocks.MSFT.notnull()]
stocks

                 AAPL       MSFT
1986-03-13  24.750001  27.999361
1986-03-14  26.125000  28.998720
1986-03-17  25.999999  29.499840
1986-03-18  26.874999  28.751040
1986-03-19  26.500001  28.249920
...               ...        ...
2016-02-17  98.120003  52.419998
2016-02-18  96.260002  52.189999
2016-02-19  96.040001  51.820000
2016-02-22  96.879997  52.650002
2016-02-23  94.690002  51.180000

[7550 rows x 2 columns]

In [193]:
stocks

                 AAPL       MSFT
1986-03-13  24.750001  27.999361
1986-03-14  26.125000  28.998720
1986-03-17  25.999999  29.499840
1986-03-18  26.874999  28.751040
1986-03-19  26.500001  28.249920
...               ...        ...
2016-02-17  98.120003  52.419998
2016-02-18  96.260002  52.189999
2016-02-19  96.040001  51.820000
2016-02-22  96.879997  52.650002
2016-02-23  94.690002  51.180000

[7550 rows x 2 columns]

In [183]:
stocks[stocks.MSFT.notnull()]

            AAPL       MSFT
Date
2016-02-23   NaN  51.180000
2016-02-22   NaN  52.650002
2016-02-19   NaN  51.820000
2016-02-18   NaN  52.189999
2016-02-17   NaN  52.419998
...          ...        ...
1986-03-19   NaN  28.249920
1986-03-18   NaN  28.751040
1986-03-17   NaN  29.499840
1986-03-14   NaN  28.998720
1986-03-13   NaN  27.999361

[7550 rows x 2 columns]